README.tex
% Created 2022-04-10 Sun 19:35
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{color}
\usepackage{listings}
\author{DESKTOP-OEFS7VE}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={DESKTOP-OEFS7VE},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5.1)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Digital Ocean}
\label{sec:org98879b1}
\subsection{Box Location}
\label{sec:orgcbb8043}
\lstset{language=shell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
ssh root@142.93.64.31
\end{lstlisting}
\subsection{Password}
\label{sec:org2a1e2f6}
\lstset{language=shell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
CSC505project
\end{lstlisting}
\subsection{Project Folders}
\label{sec:org5450454}
\begin{itemize}
\item There is a folder in our repository organized with the grader in mind.
\end{itemize}
\lstset{language=shell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
/root/505p1/ForGrader/
\end{lstlisting}
\subsubsection{Where is the data on our Droplet?}
\label{sec:orgb0cc0f1}
\begin{itemize}
\item The data for the sorts is located in the following directory:
\end{itemize}
\lstset{language=shell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
/root/csc505-spring-2022/Project1/
\end{lstlisting}
\subsection{Example Process For Comparing Sorts}
\label{sec:org180a0d9}
\begin{itemize}
\item The following sequence of commands will populate the (currently empty) plots, output, and sorted files.
\item We have adjusted our scripts for this demo so that they will run in a few seconds.
\item Please make sure that you are in the following file: /root/505p1/ForGrader
\item This will run the three different sorts on some of the small files in B in order to allow you to see the quadratic nature of insertion sort take over the extra time spent allocating memory in merge sort.
\end{itemize}
\lstset{language=shell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
python3 runner_copy.py B ALL c 1000
python3 readSteveRuns.py
\end{lstlisting}
\section{Basic Run}
\label{sec:orgcf906a6}
The information below this point in the README is no longer specific to our Droplet. These commands can be run on the VCL
\lstset{language=shell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
python3 main.py logFile outputFile type(m/i/t) cost(c/e) numRuns
\end{lstlisting}
\subsection{Parameters}
\label{sec:orgf2fea30}
\begin{itemize}
\item logFile is the name of the file to sort
\item outputFile is the destination of the sorted file
\item type refers to whether insertion sort, merge sort, or timsort is used. Input is m, i, or t.
\item cost refers to whether the "cheap" or "expensive" version of our comparison is used. Input is c or e.
\item numRuns is how many times to repeat the sort
\end{itemize}
\section{Output}
\label{sec:orgd07411f}
\lstset{language=shell,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
m/i/t,cheapOrExpensive,logFile,isSorted,readTime,sortTime
\end{lstlisting}
\end{document}